const dataExample = [
    {
        period: { '0' : '1' },
        groop: { '0' : '1' },
        one : {'1' : '<b>(H)</b>'},
        two: { '0' : '' },
        three: {'0' : '' },
        four: {'0' : '' },
        five: {'0' : '' },
        six: {'0' : '' },
        seven: { '1' : '<b>H</b> &#8195;&#8195;1 <br> Водород' },
        eight: { '1' : '<b>He</b> &#8195;2 <br> Гелий' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    },
    {
        period: { '0' : '2' },
        groop: { '0' : '2' },
        one: { '1' : '<b>Li </b> &#8195;&#8195;3  <br> Литий' },
        two: { '1' : '<b>Be</b>  &#8195;&#8195;4  <br> Бериллий' },
        three: { '2' : '<b>B</b> &#8195;&#8195;5  <br> Бор' },
        four: { '2' : '<b>С</b> &#8195;&#8195;6  <br> Углерод' },
        five: { '2' : '<b>N</b>&#8195;&#8195;7 <br> Азот' },
        six: { '2' : '<b>O</b>&#8195;&#8195;8 <br>Кислород' },
        seven: { '2' : '<b>F</b> &#8195;&#8195;9  <br> Фтор' },
        eight: { '2' : '<b>Ne</b> &#8195;10  <br> Неон' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    },
    {
        period: { '0' : '3' },
        groop: { '0' : '3' },
        one: { '1' : '<b>Na</b>&#8195;&#8195;11<br> Натрий'},
        two: { '1' : '<b>Mg</b> &#8195;12<br> Магний' },
        three: { '2' : '<b>Al</b> &#8195;&#8195;13  <br> Алюминий' },
        four:  { '2' : '<b>Si</b> &#8195;&#8195;14  <br> Кремний' },
        five:   { '2' : '<b>P</b>&#8195;&#8195;15 <br> Фосфор' },
        six: { '2' : '<b>S</b>&#8195;&#8195;16<br> Сера' },
        seven:  { '2' : '<b>Cl</b> &#8195;&#8195;17  <br> Хлор' },
        eight: { '2' : '<b>Ar</b> &#8195;18  <br> Аргон' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    },
    {
        period: { '0' : '4' },
        groop: { '0' : '4' },
        one: { '1' : '<b>K</b> &#8195;&#8195;19<br> Калий' },
        two: { '1' : '<b>Ca</b>&#8195;&#8195;20  <br> Кальций' },
        three: { '3' : '<b>Sc</b> &#8195;&#8195;21  <br> Скандий' },
        four:  { '3' : '<b>Ti</b> &#8195;&#8195;22  <br> Титан' },
        five:  { '3' : '<b>V</b>&#8195;&#8195;23 <br> Ванадий' },
        six:  { '3' : '<b>Cr</b>&#8195;&#8195;24<br>Хром' },
        seven:  { '3' : '<b>Mn</b> &#8195;&#8195;25  <br> Марганец' },
        eight:  { '3' : '<b>Fe</b> &#8195;26  <br> Железо' },
        nine:  { '3' : '<b>Co</b> &#8195;27  <br> Кобальт' },
        ten:  { '3' : '<b>Ni</b> &#8195;28  <br> Никель' }
    },
    {
        period: { '0' : '4' },
        groop: { '0' : '5' },
        one: { '3' : '<b>Cu</b>&#8195;&#8195;29<br> Медь' },
        two:  { '3' : '<b>Zn</b>  &#8195;&#8195;30  <br> Цинк' },
        three: { '2' : '<b>Ga</b> &#8195;&#8195;31  <br> Галлий' },
        four:  { '2' : '<B>Ge</b> &#8195;&#8195;32  <br> Германий' },
        five:  { '2' : '<b>As</b>&#8195;&#8195;33 <br> Мышьяк ' },
        six:  { '2' : '<b>Se</b>&#8195;&#8195;34<br>Селен' },
        seven:  { '2' : '<b>Br</b> &#8195;&#8195;35  <br> Бром' },
        eight:   { '2' : '<b>Kr</b> &#8195;36  <br> Криптон' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    },
    { 
        period: { '0' : '5' },
        groop: { '0' : '6' },
        one: { '1' : '<B>Rb</b>&#8195;&#8195;37<br> Рубидий' },
        two: { '1' :'<B>Sr</b> &#8195;&#8195;38  <br> Стронций' },
        three: { '3' : '<b>Y</b> &#8195;&#8195;39  <br> Иттрий' },
        four: { '3' : '<b>Zr</b> &#8195;&#8195;40  <br> Цирконий' },
        five: { '3' : '<b>Nb</b>&#8195;&#8195;41 <br> Ниобий' },
        six:  { '3' : '<b>Mo</b>&#8195;&#8195;42<br>Молибден' },
        seven:  { '3' : '<b>Tc</b> &#8195;&#8195;43  <br> Технеций' },
        eight:  { '3' : '<b>Ru</b> &#8195;44  <br> Рутений' },
        nine:  { '3' : '<b>Rh</b> &#8195;45  <br> Родий' },
        ten:  { '3' : '<b>Pd</b> &#8195;46  <br> Палладий' }
    },
    {
        period: { '0' : '5' },
        groop: { '0' : '7' },
        one: { '3' : '<b>Ag</b>&#8195;&#8195;47 <br> Серебро' },
        two: { '3' : '<b>Cd</b> &#8195;&#8195;48  <br> Кадмий' },
        three: { '2' : '<b>In</b> &#8195;&#8195;49  <br> Индий' },
        four:  { '2' : '<b>Sn</b> &#8195;&#8195;50  <br> Олово' },
        five: { '2' : '<b>Sb</b>&#8195;&#8195;51 <br> Сурьма' },
        six:  { '2' : '<b>Te</b>&#8195;&#8195;52<br>Теллур' },
        seven:  { '2' : '<b>I</b> &#8195;&#8195;53  <br> Йод' },
        eight:  { '2' : '<b>Xe</b> &#8195;54  <br> Ксенон' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    },
    { 
        period: { '0' : '6' },
        groop: { '0' : '8' },
        one: { '1' : '<B>Cs</b>&#8195;&#8195;55 <br> Цезий' },
        two: { '1' : '<b>Ba</b> &#8195;&#8195;56  <br> Барий' },
        three: { '4' : '<b>La</b> &#8195;&#8195;57  <br> Лантан' },
        four: { '3' : '<b>Hf</b> &#8195;&#8195;72  <br> Гафний' },
        five: { '3' : '<b>Ta</b>&#8195;&#8195;73 <br> Тантал' },
        six:  { '3' : '<b>W</b>&#8195;&#8195;74<br>Вольфрам' },
        seven:  { '3' : '<b>Re</b> &#8195;75  <br> Рений' },
        eight:  { '3' : '<b>Os</b> &#8195;76  <br> Осмий' },
        nine:  { '3' : '<b>Ir</b> &#8195;77  <br> Иридий' },
        ten:  { '3' : '<b>Pt</b> &#8195;78  <br> Платина' }
    },
    {
        period: { '0' : '6' },
        groop: { '0' : '9'},
        one: { '3' : '<b>Au</b>&#8195;&#8195;79<br> Золото' },
        two: { '3' : '<b>Hg</b> &#8195;&#8195;80  <br> Ртуть' },
        three:  { '2' : '<b>Tl</b> &#8195;&#8195;81  <br> Таллий' },
        four:  { '2' : '<b>Pb</b> &#8195;&#8195;82  <br> Свинец' },
        five:  { '2' : '<b>Bi</b>&#8195;&#8195;83 <br> Висмут' },
        six:  { '2' : '<b>Po</b>&#8195;&#8195;84<br>Полоний' },
        seven:  { '2' : '<b>At</b> &#8195;&#8195;85  <br> Астат' },
        eight:  { '2' : '<b>Rn</b> &#8195;86  <br> Радон' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    },
    { 
        period: { '0' : '7' },
        groop: { '0' : '10' },
        one: { '1' : '<b>Fr</b>&#8195;&#8195;87 <br> Франций' },
        two: { '1' : '<b>Ra</b> &#8195;&#8195;88  <br> Радий' },
        three: { '4' : '<b>Ac</b> &#8195;&#8195;89  <br> Актиний' },
        four: { '3' : '<b>Rf</b> &#8195;104  <br> Разерфордий' },
        five: { '3' : '<b>Db</b>&#8195;105 <br> Дубний' },
        six: { '3' : '<b>Sg</b>&#8195;106<br>Сиборгий' },
        seven: { '3' : '<b>Bh</b> &#8195;107  <br> Борий' },
        eight: { '3' : '<b>Hs</b> &#8195;108  <br> Хассий' },
        nine: { '3' : '<b>Mt</b> &#8195;109  <br> Майтнерий' },
        ten: { '3' : '<b>Ds</b> &#8195;110  <br> Дармштадтий' }
    },
    {
        period: { '0' : '7' },
        groop: { '0' : '11' },
        one: { '3' : '<b>Rg</b>&#8195;111 <br> Рентгений' },
        two: { '3' : '<b>Cn</b> &#8195;112  <br> Коперниций' },
        three: { '2' : '<b>Nh</b> &#8195;113  <br> Нихоний' },
        four:  { '2' : '<b>Fl</b> &#8195;114  <br> Флеровий' },
        five:  { '2' : '<b>Mc</b>&#8195;115 <br> Московий' },
        six:  { '2' : '<b>Lv</b>&#8195;116<br>Ливерморий' },
        seven:  { '2' : '<b>Ts</b> &#8195;117  <br> Теннессин' },
        eight:  { '2' : '<b>Og</b>&#8195;118 <br> Оганесон' },
        nine: {'0' : '' },
        ten: {'0' : '' }
    }
];

let gridView = new GridView();
const data = {
    header: 'Периодическая Таблица Д. И. Менделеева',
    headerClass: ['header'],
    tableClass: [],
    attribute: {
        'period': {
            'label': 'Период',
           

        },
        'groop': {
            'label': 'Ряд', 
        
        },
        'one': {
            'label': 'I',
            'src': 'html',
       
            
        },
        'two': {
            'label': 'II',
            'src': 'html',
        },
        'three': {
            'label': 'III',
            'src': 'html',
         
        },
        'four': {
            'label': 'IV',
            'src': 'html',
        },
        'five': {
            'label': 'V',
            'src': 'html',
        },
        'six': {
            'label': 'VI',
            'src': 'html',
        },
        'seven': {
            'label': 'VII',
            'src': 'html',
        },
        'eight': {
            'label': 'VIII',
            'src': 'html',
        },
        'nine': {
            'label': 'VIII',
            'src': 'html',
        }, 
        'ten': {
            'label': 'VIII',
            'src': 'html',
        }
    },
    data: dataExample
}

gridView.render(data);
console.log(gridView);

const dataExampleFront = [
    {
        label : { '5' : '<b>Лактоноиды</b>' },
        one : { '4' : '<b>Ce</b>&#8195;58 <br> Церий' },
        two : { '4' : '<b>Pr</b>&#8195;59<br>Празеодим' },
        three : { '4' : '<b>Nd</b>&#8195;60 <br>Неодим' },
        four : { '4' : '<b>Pm</b>&#8195;61 <br> Прометий' },
        five : { '4' : '<b>Sm</b>&#8195;62 <br> Самарий' },
        six : { '4' : '<b>Eu</b>&#8195;63 <br> Европий' },
        seven : { '4' : '<b>Gd</b>&#8195;64 <br> Гадолиний' },
        eight : { '4' : '<b>Tb</b>&#8195;65 <br> Тербий' },
        nine : { '4' : '<b>Dy</b>&#8195;66 <br> Диспрозий' },
        ten : { '4' : '<b>Ho</b>&#8195;67 <br> Гольмий' },
        eleven : { '4' : '<b>Er</b>&#8195;68 <br> Эрбий' },
        twelve : { '4' : '<b>Tm</b>&#8195;69 <br> Тулий' },
        thirteen : { '4' : '<b>Yb</b>&#8195;70 <br> Иттербий' },
        fourteen : { '3' : '<b>Lu</b>&#8195;71 <br> Лютеций' }
    },
    {
        label : { '5' : '<b>Актиноиды</b>' },
        one : { '4' : '<b>Th</b>&#8195;90 <br> Торий' },
        two : { '4' : '<b>Pa</b>&#8195;91 <br> Протактиний' },
        three : { '4' : '<b>U</b>&#8195;92 <br> Уран' },
        four : { '4' : '<b>Np</b>&#8195;93 <br> Нептуний' },
        five : { '4' : '<b>Pu</b>&#8195;94 <br> Плутоний' },
        six : { '4' : '<b>Am</b>&#8195;95 <br> Америций' },
        seven : { '4' : '<b>Cm</b>&#8195;96 <br> Кюрий' },
        eight : { '4' : '<b>Bk</b>&#8195;97 <br> Берклий' },
        nine : { '4' : '<b>Cf</b>&#8195;98 <br> Калифорний' },
        ten : { '4' : '<b>Es</b>&#8195;99 <br> Эйнштейний' },
        eleven : { '4' : '<b>Fm</b>&#8195;100 <br> Фермий' },
        twelve : { '4' : '<b>Md</b>&#8195;101 <br> Менделевий' },
        thirteen : { '4' : '<b>No</b>&#8195;102 <br> Нобелий' },
        fourteen : { '3' : '<b>Lr</b>&#8195;103 <br> Лоуренсий' }
    }
];

let tableFront = new TableFront();
const data2 = {
    tableClass: [],
    attribute: {
        'label': {
            'src': 'html',
        },
        'one': {
            'src': 'html',   
        },
        'two': {
            'src': 'html',
        },
        'three': {
            'src': 'html',
         
        },
        'four': {
            'src': 'html',
        },
        'five': {
            'src': 'html',
        },
        'six': {
            'src': 'html',
        },
        'seven': {
            'src': 'html',
        },
        'eight': {
            'src': 'html',
        },
        'nine': {
            'src': 'html',
        }, 
        'ten': {
            'src': 'html',
        },
        'eleven': {
            'src': 'html',
        },
        'twelve': {
            'src': 'html',
        },
        'thirteen': {
            'src': 'html',
        },
        'fourteen': {
            'src': 'html',
        }

    },
    data2: dataExampleFront
}
tableFront.render(data2);
console.log(tableFront);
